{
  "backend/main.mo": "Motoko actor defining data models (JobListing, ExamResult, AdmitCard, NewsUpdate, GovernmentScheme) and CRUD operations with comparison functions for sorting by dates.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs for homepage, jobs, results, admit cards, news, and schemes sections.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend components including pages, layout components, cards, filters, and custom hooks for data fetching.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and component styling tokens.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for all pages (home, jobs, results, admit cards, news, schemes) wrapped in Layout component.",
  "frontend/src/components/admitcards/AdmitCardCard.tsx": "Admit card display component showing exam details, dates, download link, instructions, and highlighting upcoming exams with countdown badges.",
  "frontend/src/components/admitcards/AdmitCardFilters.tsx": "Filter controls for admit cards page with organization dropdown and exam date range pickers, including clear filters functionality.",
  "frontend/src/components/home/FeaturedUpdates.tsx": "Displays the latest updates from five categories (jobs, results, admit cards, news, schemes) in a grid layout with loading states, formatted dates, and navigation to detail pages.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero section with a background image, gradient overlay, title, description, and five quick-access cards linking to main portal sections.",
  "frontend/src/components/jobs/JobCard.tsx": "Displays a single job listing card with title, organization, vacancy count, location, deadline, active/closed status badge, and days-left indicator.",
  "frontend/src/components/jobs/JobDetailsModal.tsx": "Modal component showing detailed job information including status, post name, vacancies, location, dates, qualification, salary, and application link with formatted dates.",
  "frontend/src/components/jobs/JobFilters.tsx": "Provides filtering UI for job listings with search/select inputs for qualification, location, organization, and status, plus a clear-all-filters button.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with three columns (about, quick links, disclaimer), copyright notice, and caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, site title, desktop navigation menu, and mobile hamburger menu that toggles a dropdown navigation.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps all pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/news/NewsCard.tsx": "Displays a single news update card with category badge, headline, summary, publication date, source, and external link. Formats bigint timestamps to readable dates.",
  "frontend/src/components/news/NewsFilters.tsx": "Provides search and category filtering UI for news updates. Extracts unique categories from news data and includes a clear filters button.",
  "frontend/src/components/results/ResultCard.tsx": "Displays an exam result card showing exam name, organization, declaration date, roll number range, category info, and a link to view the result. Formats bigint timestamps to readable dates.",
  "frontend/src/components/results/ResultFilters.tsx": "Provides filtering UI for exam results with search, organization dropdown, and date range inputs. Extracts unique organizations from results data and includes a clear filters button.",
  "frontend/src/components/schemes/SchemeCard.tsx": "Displays a clickable government scheme card with ministry badge, scheme name, description, key benefits preview, and application process preview. Triggers onClick callback when clicked.",
  "frontend/src/components/schemes/SchemeDetailsModal.tsx": "Full-screen modal displaying complete government scheme details including description, eligibility criteria, benefits, application process, launch date, and official website link. Formats bigint timestamps to readable dates.",
  "frontend/src/components/schemes/SchemeFilters.tsx": "Provides filtering UI for government schemes with ministry/department dropdown and eligibility criteria search input. Extracts unique ministries from schemes data and includes a clear filters button.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating government portal data (job listings, exam results, admit cards, news, schemes) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining an orange and teal color scheme for light and dark modes, styled for an India government portal.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdmitCardsPage.tsx": "Displays a filterable list of admit cards for government exams, sorted by exam date with organization and date range filters.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero section and featured updates components.",
  "frontend/src/pages/JobsPage.tsx": "Displays a filterable grid of government job listings with qualification, location, organization, and status filters, plus a modal for job details.",
  "frontend/src/pages/NewsPage.tsx": "Shows a filterable grid of government news updates with search and category filters.",
  "frontend/src/pages/ResultsPage.tsx": "Displays exam results in a filterable list with search by exam name, organization, and date range. Shows loading skeletons and empty states when no results match filters.",
  "frontend/src/pages/SchemesPage.tsx": "Displays government schemes in a filterable grid layout with filters for ministry and eligibility. Includes a modal for viewing detailed scheme information.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using OKLCH, extended spacing, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining the India Government portal with architectural notes, existing features for jobs/results/admit cards/news/schemes pages, and image requirements for icons and backgrounds."
}